karaf/secure-proxy/1K_buyStocks_secure.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1357060562089156000-262197102"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>TauWxbbucqyw58aD/wQC0EvEoQJ6w/gzU9z93m8zvVkmSAFL4qW82HkdvQ2kfeycwPWEzEa6Vqzf
MVan1hjg/sXyPjQVzIokun3um4w8sc4oCi9sxeFTD9mWEuolLtGoA+TP+OTctjIhGhoNW/zeklZS
iZmO7xnY3IJP04ubVCQ=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#id-1357060562089308000-778766334"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1357060562088768000-1153656919">MIIDDDCCAfSgAwIBAgIQM6YEf7FVYx/tZyEXgVComTANBgkqhkiG9w0BAQUFADAwMQ4wDAYDVQQK
DAVPQVNJUzEeMBwGA1UEAwwVT0FTSVMgSW50ZXJvcCBUZXN0IENBMB4XDTA1MDMxOTAwMDAwMFoX
DTE4MDMxOTIzNTk1OVowQjEOMAwGA1UECgwFT0FTSVMxIDAeBgNVBAsMF09BU0lTIEludGVyb3Ag
VGVzdCBDZXJ0MQ4wDAYDVQQDDAVBbGljZTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAoqi9
9By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85AV1yiNsE
yvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQIvtpjmrDAU8V
sZKT8DN5Kyz+EZsCAwEAAaOBkzCBkDAJBgNVHRMEAjAAMDMGA1UdHwQsMCowKKImhiRodHRwOi8v
aW50ZXJvcC5iYnRlc3QubmV0L2NybC9jYS5jcmwwDgYDVR0PAQH/BAQDAgSwMB0GA1UdDgQWBBQK
4l0TUHZ1QV3V2QtlLNDm+PoxiDAfBgNVHSMEGDAWgBTAnSj8wes1oR3WqqqgHBpNwkkPDzANBgkq
hkiG9w0BAQUFAAOCAQEABTqpOpvW+6yrLXyUlP2xJbEkohXHI5OWwKWleOb9hlkhWntUalfcFOJA
gUyH30TTpHldzx1+vK2LPzhoUFKYHE1IyQvokBN2JjFO64BQukCKnZhldLRPxGhfkTdxQgdf5rCK
/wh3xVsZCNTfuMNmlAM6lOAg8QduDah3WFZpEA0s2nwQaCNQTNMjJC8tav1CBr6+E5FAmwPXP7pJ
xn9Fw9OXRyqbRA4v2y7YpbGkG2GI9UvOHw6SGvf4FRSthMMO35YbpikGsLix3vAsXWWi4rwfVOYz
QK0OFPNi9RMCUdSH06m9uLWckiCxjos0FQODZE9l4ATGy9s9hNVwryOJTw==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-1357060562084942000-10490004">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>3egMsqweeGTMg4VCTml5gOM+AUQ=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-1357060562084437000-631768569">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>wgrTXmG9r8JgVJLxcLRnmXhhr9I=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
GbCz/eK9g80dyATDh97u3xvkA3uSBkS3Y2gdt2CteHR79pXVuPagxaGJMk0UZnBWIaa4cIM5w/09
ICdkfpcLyiPw7h90HZrSh6tyN+sB9eloHcY3QnfXHDqa+0BcxmP0/t/qd9TMrSu2bsxPfPBdj16B
xVA75hC8FK4r4YGhN5w=
</ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#id-1357060562088768000-1153656919" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1357060562084437000-631768569"><wsu:Created>2013-01-01T17:16:02.084Z</wsu:Created><wsu:Expires>2013-01-31T17:16:02.084Z</wsu:Expires></wsu:Timestamp></wsse:Security><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body wsu:Id="id-1357060562084942000-10490004" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1357060562089308000-778766334" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#id-1357060562089156000-262197102"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>YBj1jZRTOQ4OekbD6Pqwcz9E80Jr+UBTiXorTEaxXSveO0LGrHKkfEePrgb6M1GDKHkRJ06pjA3B
HM1fB4lTFga3XG8yN9mlb/AmpBx1L0ftMhXa2Zf3MQATPL5eRvyoGNE9Qnhy+Ca9SRJBgj3e23gx
4PRgSJmweBLdXqI8OoDaLxxIzBYDCXZ1p7Ja4YO8sEckk8LDLtifgLPBX8m+PMeENTicA+TT6ro/
zeBLO53Z6gTp5PYZjdeKpJ+VkTYAI+7KANozu+t7k+EV4y0juABy9qOxO3BYI7EXz2Bq5Y3UQtX5
/503C62cKIOAFeSRpT7Q4ZflfsbT2IaEvhNHi7RzVmlPjXCCNf03TZzxrTg/WFhEFo9wa051a5dN
Gm/dgzG0Z89JfYD5pP6AWos5lP0gDMZIGxDvAz+iNLxyNjDwcZA27D+a/EoEvhgySXIAjpmfydJq
sxZeSzhT0ilcSYdmimU87CWOYlUzMv2k05oalE3sv7vtiCwmk2OuMTZtKHIifvhobOjdUcWM3Q/A
WIb8s04lbz5LefaKzkfz5lIaRwoYvywFsHNF+yM92KQnyk4feA1d5EeTAcV1y/NDumjZZ1hVv+L9
iPBE3pT8EBRGFVFDBbS6X211b5RYBB2zMEOYVKNNAlDYFL+de0E4fKvrivyLviNo90jLr/1p3s0/
Phamz0gv0W3VDTFJypJL592DdvbOjO52R+elb3COskRSkQdfnGL/B0bbuBpDgbR3aLDUoDvGFZPf
7F3WwvydQ21YIeo3TMGsY0e6/+QCOQfWFoRk+ZU1+GAs4ejp7Mg+hLBa4bv52Gu5l3urdd5nigER
XSXexTnm28lnkWxUS1YDrr0TE7OmQcepZIjDnesPZ909G0LDQLkPbr7dKjkAQOSm1oCLiXecSE2z
H2PcsSk5G/4l608dlRVBApjoaGnx2Pz0iRu7ztuU4aYmoip5wFClv9Bax0xIPyo3Xd6AQZo1sy4X
yKvOoUaGBxlAmplttLEAscyzMlJpZWNK47aFoj2R6gfoJ+82Lk6XbT4CQ1HbB5flnS92cvOpAxKC
qbGptKGrXVgqbyRLZxm0/VCL</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>